# 1.Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться
# звездочками


# def get_card_number(number=input()):
#     return (number.replace(number[:-4], '*' * len(number[:-4])))
#
#
# print(get_card_number)

#или так

# def card_hide(card):
#     return '*' * (len(card)-4) + card[-4:]
#
#
# print(card_hide)


# 2. Напишите функцию, которая проверяет: является ли слово палиндромом
#
# def get_palindrome():
#     palindrome = input()
#     return palindrome.lower() == palindrome.lower()[::-1]
#
#
# print(get_palindrome())



